org-content/education.org
#+hugo_base_dir: ../
#+hugo_section: /

* DONE Education
CLOSED: [2023-06-08 Thu 14:48]
:PROPERTIES:
:EXPORT_FILE_NAME: education
:END:
** BSc
I have a bachelor's degree in [[https://www.uib.no/en/studies/BASV-KOGNI][Cognitive Science]] from the [[https://www.uib.no/][University of Bergen]], Norway.

The full course plan for the degree can be found at the university's websites,
but unfortunately, the [[https://www.uib.no/infomedia/154615/tatt-opp-p%C3%A5-kogvit-f%C3%B8r-2022][relevant plan]] (admission in 2019) is only available in
Norwegian.

Each course page does however have an English version. A brief overview is
provided below for the reader's convenience.

#+begin_details
#+begin_summary
Courses in Cognitive Science at UiB
#+end_summary
- KOGVIT101 - Introduction to Cognitive Science
- INF100 - Introduction to Programming (Python)
- EXFAC00SK - Introduction to Linguistics
- DASPSTAT - Statistics for Cognition Research
- LOG110 - Introduction to Formal Logic
- LOG111 - First-Order Logic
- INF101 - Introduction to Object-Oriented Programming (Java)
- LING122 - Languages and Cognition
- INFO282 - Knowledge Representation and Reasoning (Prolog)
- INF122 - Introduction to Functional Programming (Haskell)
- FIL105 - Philosophy of Mind
- PSYK120 - Cognitive and Biological Psychology
- EXPHIL-PSSEM - Examen Facultatum in Psychology
- INFO135 - Algorithms, Data Structures, and Programming
- MAT111 - Introduction to Calculus
- INF223 - Category Theory
- INF227 - Mathematical Logic
- MAT121 - Linear Algebra
#+end_details

During my BSc, I had an exchange semester at the
[[https://www.unibo.it/it][University of Bologna]], Italy.


** MSc

I am currently in the second (and final) year of my master's degree in
[[https://www.uio.no/studier/program/informatikk-programmering-master/][Programming and System Architecture]] at the [[https://www.uio.no/][University of Oslo]], Norway, with the
software specialisation.

The courses I have taken at UiO are briefly summarised below.

#+begin_details
#+begin_summary
Courses in Programming and System Architecture at UiO
#+end_summary
- IN5130 - Modelling Unassailable IT-Systems
- IN5170 - Models of Concurrency
- TEK5510 - Security in Operating Systems and Software
- IN5570 - Distributed Objects
- IN5580 - Computability Theory
- INF5110 - Compiler Construction
- Special Curriculum - Advanced Functional Programming, Semantics, and Types
#+end_details
