content/education/education.md
+++
title = "Education"
date = 2023-06-08T14:48:00+02:00
draft = false
+++

## BSc {#bsc}

I have a bachelor's degree in [Cognitive Science](https://www.uib.no/en/studies/BASV-KOGNI) from the [University of Bergen](https://www.uib.no/), Norway.

The full course plan for the degree can be found at the university's websites,
but unfortunately, the [relevant plan](https://www.uib.no/infomedia/154615/tatt-opp-p%C3%A5-kogvit-f%C3%B8r-2022) (admission in 2019) is only available in
Norwegian.

Each course page does however have an English version. A brief overview is
provided below for the reader's convenience.

<details>
<summary>Courses in Cognitive Science at UiB</summary>
<div class="details">

-   KOGVIT101 - Introduction to Cognitive Science
-   INF100 - Introduction to Programming (Python)
-   EXFAC00SK - Introduction to Linguistics
-   DASPSTAT - Statistics for Cognition Research
-   LOG110 - Introduction to Formal Logic
-   LOG111 - First-Order Logic
-   INF101 - Introduction to Object-Oriented Programming (Java)
-   LING122 - Languages and Cognition
-   INFO282 - Knowledge Representation and Reasoning (Prolog)
-   INF122 - Introduction to Functional Programming (Haskell)
-   FIL105 - Philosophy of Mind
-   PSYK120 - Cognitive and Biological Psychology
-   EXPHIL-PSSEM - Examen Facultatum in Psychology
-   INFO135 - Algorithms, Data Structures, and Programming
-   MAT111 - Introduction to Calculus
-   INF223 - Category Theory
-   INF227 - Mathematical Logic
-   MAT121 - Linear Algebra
</div>
</details>

During my BSc, I had an exchange semester at the
[University of Bologna](https://www.unibo.it/it), Italy.


## MSc {#msc}

I am currently in the second (and final) year of my master's degree in
[Programming and System Architecture](https://www.uio.no/studier/program/informatikk-programmering-master/) at the [University of Oslo](https://www.uio.no/), Norway, with the
software specialisation.

The courses I have taken at UiO are briefly summarised below.

<details>
<summary>Courses in Programming and System Architecture at UiO</summary>
<div class="details">

-   IN5130 - Modelling Unassailable IT-Systems
-   IN5170 - Models of Concurrency
-   TEK5510 - Security in Operating Systems and Software
-   IN5570 - Distributed Objects
-   IN5580 - Computability Theory
-   INF5110 - Compiler Construction
-   Special Curriculum - Advanced Functional Programming, Semantics, and Types
</div>
</details>
